// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Cancelar";
"GOBACK_BUTTON"		= "Voltar";
"DIAGNOSE_BUTTON"	= "Diagnóstico";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Configurando seu computador...";
"MESSAGE_PREP_CONNECTION"	= "Preparando para a conexão...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Erro Inesperado";
"MESSAGE_FATAL_ERROR_TITLE"		= "Desculpe, ocorreu um erro inesperado.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Erro";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Desculpe...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Desculpe";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Aviso";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Deseja continuar?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Você não forneceu todas as informações necessárias.";
"ERROR_MESSAGE_VALIDATION_0001" = "Por favor, verifique os campos marcados com setas vermelhas e digite as informações solicitadas.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "O texto que você digitou é muito curto.";
"ERROR_MESSAGE_VALIDATION_0002" = "Por favor, verifique o campo destacado e corrija o texto digitado.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "A informação que você digitou é incorreta.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "O nome de usuário que você digitou não é válido.";
"ERROR_MESSAGE_VALIDATION_0004" = "Por favor, verifique o campo destacado e digite um nome de usuário válido para sua rede NetInfo.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "A senha que você digitou é incorreta.";
"ERROR_MESSAGE_VALIDATION_0005" = "Por favor, verifique o campo destacado e digite a senha correta.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "O nome que você digitou não pode ser utilizado.";
"ERROR_MESSAGE_VALIDATION_0006" = "Por favor, verifique o campo destacado e escolha uma abreviação de nome diferente.";
"ERROR_MESSAGE_VALIDATION_0007" = "Já existe um usuário com esta abreviação de nome. Por favor, digite uma abreviação de nome diferente.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "O endereço IP que você digitou está vazio.";
"ERROR_MESSAGE_VALIDATION_0010" = "O endereço IP que você digitou contém caracteres inválidos.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "O endereço deve conter 4 segmentos."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Verifique o campo destacado e digite um endereço válido. Se você não souber essa informação, pergunte ao administrador de sua rede.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "O endereço deve conter 4 segmentos."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Verifique o campo destacado e digite um endereço válido. Se você não souber esta informação, pergunte ao administrador de sua rede.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Cada segmento de endereço deve conter entre 1 e 3 caracteres."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Verifique o campo destacado e digite um endereço válido. Se você não souber esta informação, pergunte ao administrador de sua rede.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "O endereço que você digitou não está permitido.";
"ERROR_MESSAGE_VALIDATION_0014" = "Verifique o campo destacado e digite um endereço válido. Se você não souber esta informação, pergunte ao administrador de sua rede.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "A máscara de sub-rede que você digitou não é válida.";
"ERROR_MESSAGE_VALIDATION_0015" = "Verifique o campo destacado e digite uma máscara de sub-rede válida. Se você não souber esta informação, pergunte ao administrador de sua rede.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "O nome que você digitou já existe em sua rede NetInfo. Você não poderá iniciar a sessão em NetInfo utilizando este nome.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Você não pode ter o mesmo valor.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "A senha que você digitou é inválida.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "O número de cartão de crédito que você digitou não pode ser utilizado.";
"ERROR_MESSAGE_VALIDATION_0019" = "Por favor, verifique o campo destacado e digite um número de cartão de crédito válido.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "O nome de sua conta não pode começar por um número.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "O endereço de e-mail que você digitou talvez não seja válido.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "O endereço IP e o endereço do roteador não são coerentes com a máscara de sub-rede digitada. Verifique os seguintes campos e digite valores válidos:\n     Endereço IP\n     Máscara de Sub-rede\n     Endereço do Roteador\nSe você não souber esta informação, pergunte ao administrador de sua rede.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "O nome que você digitou não pode ser utilizado.";
"ERROR_MESSAGE_VALIDATION_0023" = "Por favor, verifique o campo destacado e escolha um nome diferente.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Há duplicatas.";
"ERROR_MESSAGE_VALIDATION_0024" = "Verifique o campo destacado e digite valores exclusivos.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Seu modem não consegue detectar uma sinal de linha.";
"MESSAGE_NO_DIAL_TONE"					= "Certifique-se de que o modem esteja conectado e, em seguida, clique em OK. Ou clique em Cancelar para voltar e selecionar a caixa Ignorar sinal de linha.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Encerrar";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "As senhas não coincidem.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Por favor, verifique o campo marcado com setas vermelhas e digite a mesma senha em ambos os campos.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Digite um nome para a localização.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Você está criando uma nova localização de rede onde as informações de configuração são salvas. Agora você deve digitar um nome para a localização.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Digite um nome de localização diferente.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "O nome da localização digitada já existe. Digite um nome diferente.";


"MESSAGE_TASK_FORMAT" = "“%1$@ conexão via %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Sem Fio";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Modem a Cabo";
"CONNECTION_Lan" = "Rede de Área Local";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP com ID de Cliente";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "IP Estático";

"MESSAGE_TITLE_CONFIGURE" = "Configurando...";
"MESSAGE_FAILED_CONFIGURE" = "Falha na configuração.";
"MESSAGE_DONE_CONFIGURE" = "Finalizar configuração.";
"MESSAGE_CHECKING_CONNECTION" = "Verificando sua conexão de rede...";
"MESSAGE_CONNECTED" = "A conexão de rede está estabelecida.";
"MESSAGE_NOT_CONNECTED" = "Impossível estabelecer uma conexão de rede.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Seu computador não pôde conectar-se à Internet. Clique em OK para voltar e alterar seus ajustes de rede e, em seguida, tente novamente.";

"DEFAULT_LOCATION_NAME" = "Localização (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";